[
  {
    "id": 0,
    "name": "Международный женский день",
    "description": "Междунаро́дный же́нский день — праздник, отмечаемый ежегодно 8 марта в ряде стран как «женский день». Исторически появился как день солидарности женщин во многих странах в борьбе за равные права и эмансипацию. С марта 1975 года Международный женский день отмечается в ООН.",
    "message": "",
    "date": {
      "day": 8,
      "month": 3
    },
    "category": "General holidays",
    "defaultNotify": true
  },
  {
    "id": 3,
    "name": "День программиста",
    "description": "Праздник программистов, отмечаемый в 256-й день года. Число 256 выбрано потому, что это количество различных значений, которые можно выразить с помощью восьмиразрядного байта. Также это максимальная целая степень числа 2, которая не превышает количества дней в году.",
    "message": "",
    "date": {
      "type": "dayInYear",
      "day": 256
    },
    "category": "Professional Holiday",
    "defaultNotify": true
  },
  {
    "id": 4,
    "name": "День учителя",
    "description": "День учителя — профессиональный праздник работников сферы образования — отмечается в ряде стран постсоветского пространства в первое воскресенье октября.\n\nСвою историю он ведёт с 1965 года, когда, в эпоху существования СССР, отмечался повсеместно во всех Республиках Советского Союза согласно Указу Президиума Верховного Совета СССР от 1 октября 1980 года «О праздничных и памятных датах».\n\nУчитель — это не только человек, обучающий наукам, но еще и носитель духовности и нравственного начала. Учителя выполняют особую гражданскую миссию — воспитание молодого поколения. Их знания и опыт, преемственность традиций и новаторство лежат в основе каждой школы.\n\nСегодня хочется пожелать всем учителям доброго здоровья, мира, благополучия. А также неустанного поиска истины и знания, взаимопонимания в коллективе и благодарных, любознательных учеников!",
    "message": "День учителя — один из самых любимых профессиональных праздников. В этот день учителя принимают поздравления от своих воспитанников, которые дарят им подарки.",
    "date": {
      "day": 5,
      "month": 10
    },
    "category": "Professional Holiday",
    "defaultNotify": true
  },
  {
    "id": 5,
    "name": "Международный день музыки",
    "description": "Праздник отмечается ежегодно во всем мире большими концертными программами, с участием лучших артистов и художественных коллективов. В этот день звучат сочинения, вошедшие в сокровищницу мировой культуры. Также проходят творческие встречи с композиторами, исполнителями, музыковедами, организуются тематические выставки и акции просветительского характера, что способствует цели распространения музыки как искусства в самых разных сообществах.\n\nМузыка — вид искусства, в котором средством воплощения художественных образов служат определенным образом организованные музыкальные звуки. \n\nВ 2000 году китайские археологи обнаружили музей музыкальных инструментов, созданных две тысячи лет назад, в эпоху династии Хань.\n\nМузыка обладает огромной силой. На свете найдется мало людей, равнодушных к музыке. Многие композиторы пытались выразить через нее состояние своей души. Их великие имена всегда с благодарностью будут произносить потомки. Музыка не стареет, она будет жить столько, сколько будет существовать человек.",
    "message": "",
    "date": {
      "day": 1,
      "month": 10
    },
    "category": "General holidays",
    "defaultNotify": true
  },
  {
    "id": 6,
    "name": "Праздник весны и труда",
    "description": "1 мая во многих странах мира отмечается международный праздник — День труда (Праздник Весны и Труда), который изначально носил название День международной солидарности трудящихся.\n\n1 мая 1886 года американские рабочие организовали забастовку в Чикаго, выдвинув требование 8-часового рабочего дня. Забастовка и сопутствующая демонстрация закончились кровопролитным столкновением с полицией.\n\nВ июле 1889 года Парижский конгресс II Интернационала в память о выступлении рабочих принял решение о проведении 1 мая ежегодных демонстраций. Впервые день международной солидарности трудящихся был отмечен в 1890 году в Австро-Венгрии, Бельгии, Германии, Дании, Испании, Италии, США, Норвегии, Франции, Швеции и некоторых других странах.\n\n\nДолгое время Первомай был символом революции, непримиримой классовой борьбы, имел «политическую окраску» и отмечался демонстрациями, украшенными портретами политических деятелей, передовиков производства, лозунгами, призывами, плакатами и диаграммами о достижениях в той или иной отрасли народного хозяйства, науки, культуры. Но постепенно этот контекст терялся.\n\nСегодня праздник отмечается в 142 странах и территориях мира 1 мая или в первый понедельник мая. Для ряда стран традиция собирать людей под знамена профсоюзов еще сохранилась, но в большинстве государств это все же не политический праздник, а именно День труда, яркий весенний праздник, когда организуются народные гуляния, выступления артистов, ярмарки, мирные шествия и множество увеселительных мероприятий. А для кого-то это просто еще один выходной, в течение которого можно отдохнуть или провести время с семьей.",
    "message": "1 мая во многих странах мира отмечается международный праздник — День труда (Праздник Весны и Труда), который изначально носил название День международной солидарности трудящихся.",
    "date": {
      "day": 1,
      "month": 5
    },
    "category": "General holidays",
    "defaultNotify": true
  }
]