[
  {
    "name": "Международный женский день",
    "description": "Междунаро́дный же́нский день — праздник, отмечаемый ежегодно 8 марта в ряде стран как «женский день». Исторически появился как день солидарности женщин во многих странах в борьбе за равные права и эмансипацию. С марта 1975 года Международный женский день отмечается в ООН.",
    "message": "123",
    "date": {
      "day": 8,
      "month": 3
    },
    "category": "General holidays",
    "notify": true
  },
  {
    "name": "Международный день защиты детей",
    "description": "Решение о проведении Международного дня защиты детей было принято на Всемирной конференции, посвященной вопросам благополучия детей, которая состоялась в Женеве в 1925 году. Почему этот детский праздник было решено отмечать именно 1 июня? По одной из версий, 1 июня 1925 года Генеральный консул Китая в Сан-Франциско собрал группу китайских детей-сирот и устроил для них празднование Дуань-у цзе (Фестиваля лодок-драконов). По счастливой случайности этот день совпал и со временем проведения «детской» конференции в Женеве.\\n\\nПосле Второй мировой войны, когда проблемы сохранения здоровья и благополучия детей были как никогда актуальны, в 1949 году в Париже состоялся конгресс женщин, на котором прозвучала клятва о безустанной борьбе за обеспечение прочного мира, как единственной гарантии счастья детей. Через год, 1 июня 1950-года, был проведен первый Международный день защиты детей, после чего этот праздник проводится ежегодно.",
    "message": "Международный день защиты детей отмечается ежегодно более чем в 30 странах мира и является одним из наиболее старых международных праздников. Решение о его проведении было принято в 1925 году на Всемирной конференции в Женеве, посвященной вопросам благополучия детей. Впервые день защиты детей был проведен в 1950 году в 51 стране мира. ООН поддержала эту инициативу и объявила защиту прав, жизни и здоровья детей одним из приоритетных направлений своей деятельности.",
    "date": {
      "day": 1,
      "month": 6
    },
    "category": "General holidays",
    "notify": false
  },
  {
    "name": "Рождество (по Юлианскому календарю)",
    "description": "Во всем мире Рождество празднуют 25 декабря, только некоторые страны, которые находятся под православным влиянием, продолжают праздновать Рождество по, так званому, старому стилю - 7 Января. Вся эта суета из-за того, что православная церковь использует давно устаревший Юлианский календарь, введённый Юлием Цезарем. Европа отказалась от Юлианского календаря из-за его погрешностей более 500 лет назад, и в 1582 году перешла на более точный Григорианский календарь. По Юлианскому календарю Рождество выпадает на 7 Января, а Новый год - 14. Например, в Украине можно наблюдать такой парадокс: люди празднуют Рождество (когда родился Иисус) по устаревшему Юлианскому календарю, а Новый год (когда Иисусу дали Имя) - по современному Григорианскому. Парадокс заключается в том, что Новый год получился перед Рождеством.",
    "message": "С Рождеством Христовым! Пусть этот волшебный праздник наполнит вашу жизнь светом, теплом, радостью и благополучием. Желаем вам мира, добра, любви, семейного уюта.",
    "date": {
      "day": 7,
      "month": 1
    },
    "category": "Religious holiday",
    "notify": true
  },
  {
    "name": "День программиста",
    "description": "Праздник программистов, отмечаемый в 256-й день года. Число 256 выбрано потому, что это количество различных значений, которые можно выразить с помощью восьмиразрядного байта. Также это максимальная целая степень числа 2, которая не превышает количества дней в году.",
    "message": "",
    "date": {
      "day": 13,
      "month": 9
    },
    "category": "Professional Holiday",
    "notify": false
  },
  {
    "name": "День учителя",
    "description": "День учителя — профессиональный праздник работников сферы образования — отмечается в ряде стран постсоветского пространства в первое воскресенье октября.\n\nСвою историю он ведёт с 1965 года, когда, в эпоху существования СССР, отмечался повсеместно во всех Республиках Советского Союза согласно Указу Президиума Верховного Совета СССР от 1 октября 1980 года «О праздничных и памятных датах».\n\nУчитель — это не только человек, обучающий наукам, но еще и носитель духовности и нравственного начала. Учителя выполняют особую гражданскую миссию — воспитание молодого поколения. Их знания и опыт, преемственность традиций и новаторство лежат в основе каждой школы.\n\nСегодня хочется пожелать всем учителям доброго здоровья, мира, благополучия. А также неустанного поиска истины и знания, взаимопонимания в коллективе и благодарных, любознательных учеников!",
    "message": "День учителя — один из самых любимых профессиональных праздников. В этот день учителя принимают поздравления от своих воспитанников, которые дарят им подарки.",
    "date": {
      "day": 5,
      "month": 10
    },
    "category": "Professional Holiday",
    "notify": true
  },
  {
    "name": "Международный день музыки",
    "description": "Праздник отмечается ежегодно во всем мире большими концертными программами, с участием лучших артистов и художественных коллективов. В этот день звучат сочинения, вошедшие в сокровищницу мировой культуры. Также проходят творческие встречи с композиторами, исполнителями, музыковедами, организуются тематические выставки и акции просветительского характера, что способствует цели распространения музыки как искусства в самых разных сообществах.\n\nМузыка — вид искусства, в котором средством воплощения художественных образов служат определенным образом организованные музыкальные звуки. \n\nВ 2000 году китайские археологи обнаружили музей музыкальных инструментов, созданных две тысячи лет назад, в эпоху династии Хань.\n\nМузыка обладает огромной силой. На свете найдется мало людей, равнодушных к музыке. Многие композиторы пытались выразить через нее состояние своей души. Их великие имена всегда с благодарностью будут произносить потомки. Музыка не стареет, она будет жить столько, сколько будет существовать человек.",
    "message": "",
    "date": {
      "day": 1,
      "month": 10
    },
    "category": "General holidays",
    "notify": false
  },
  {
    "name": "Праздник весны и труда",
    "description": "1 мая во многих странах мира отмечается международный праздник — День труда (Праздник Весны и Труда), который изначально носил название День международной солидарности трудящихся.\n\n1 мая 1886 года американские рабочие организовали забастовку в Чикаго, выдвинув требование 8-часового рабочего дня. Забастовка и сопутствующая демонстрация закончились кровопролитным столкновением с полицией.\n\nВ июле 1889 года Парижский конгресс II Интернационала в память о выступлении рабочих принял решение о проведении 1 мая ежегодных демонстраций. Впервые день международной солидарности трудящихся был отмечен в 1890 году в Австро-Венгрии, Бельгии, Германии, Дании, Испании, Италии, США, Норвегии, Франции, Швеции и некоторых других странах.\n\n\nДолгое время Первомай был символом революции, непримиримой классовой борьбы, имел «политическую окраску» и отмечался демонстрациями, украшенными портретами политических деятелей, передовиков производства, лозунгами, призывами, плакатами и диаграммами о достижениях в той или иной отрасли народного хозяйства, науки, культуры. Но постепенно этот контекст терялся.\n\nСегодня праздник отмечается в 142 странах и территориях мира 1 мая или в первый понедельник мая. Для ряда стран традиция собирать людей под знамена профсоюзов еще сохранилась, но в большинстве государств это все же не политический праздник, а именно День труда, яркий весенний праздник, когда организуются народные гуляния, выступления артистов, ярмарки, мирные шествия и множество увеселительных мероприятий. А для кого-то это просто еще один выходной, в течение которого можно отдохнуть или провести время с семьей.",
    "message": "1 мая во многих странах мира отмечается международный праздник — День труда (Праздник Весны и Труда), который изначально носил название День международной солидарности трудящихся.",
    "date": {
      "day": 1,
      "month": 5
    },
    "category": "General holidays",
    "notify": true
  },
  {
    "name": "День Победы в войне над фашистской Германией",
    "description": "9 мая — День Победы в войне над фашистской Германией — является в России, бывших советских республиках и многих странах Европы одним из самых важных, трогательных и славных праздников.\n\nВ Берлинской операции 1945 года, которая стала завершающей в Великой Отечественной войне, были задействованы свыше 2,5 миллионов солдат и офицеров, 6250 танков и самоходных орудий, 7500 самолетов. Потери оказались огромными: по официальным данным, за сутки Красная Армия теряла более 15 тысяч солдат и офицеров. Всего в Берлинской операции советские войска потеряли 352 тысячи человек.\n\n9 мая 1945 года на Центральный аэродром имени Фрунзе приземлился самолет «Ли-2» с экипажем А.И. Семенкова, доставивший в Москву акт о капитуляции фашистской Германии. А 24 июня на Красной площади в Москве состоялся Парад Победы.",
    "message": "Война всегда начинается внезапно, хотя спустя поколение для историков она покажется неизбежной. В 1941 году началась самая страшная, самая близкая, самая дорогая — Великая Отечественная война. ",
    "date": {
      "day": 9,
      "month": 5
    },
    "category": "General holidays",
    "notify": true
  },
  {
    "name": "День народного единства",
    "description": "День народного единства отмечается ежегодно 4 ноября, начиная с 2005 года. Этот государственный праздник установлен в честь важного события в истории России — освобождения Москвы от польских интервентов в 1612 году, и приурочен к Дню Казанской иконы Божией Матери.\n\nИсторически этот праздник связан с окончанием Смутного времени на Руси — периода со смерти царя Ивана Грозного и до 1613 года, когда на русский престол взошел первый из династии Романовых.\n\nСмутное время — эпоха глубокого кризиса Московского государства, когда единое русское государство распалось, появились многочисленные самозванцы. Власть в Москве узурпировала «семибоярщина» во главе с князем Федором Мстиславским, пустившая в Кремль польские войска с намерением посадить на русский престол католического королевича Владислава.\n\nВ это тяжелое для страны время патриарх Гермоген призвал русский народ встать на защиту Родины, своей веры и изгнать польских захватчиков. Русские люди подхватили призыв, и вскоре началось широкое патриотическое движение за освобождение столицы. Народное ополчение возглавили князь Дмитрий Пожарский и купец Кузьма Минин. С чудотворной иконой Казанской Божией Матери Нижегородское земское ополчение сумело 4 ноября 1612 года взять штурмом Китай-город и изгнать поляков из Москвы. Эта победа послужила мощным импульсом для возрождения русского государства, а икона стала предметом особого почитания.\n",
    "message": "16 декабря 2004 года Госдума РФ приняла одновременно в трех чтениях поправки в Федеральный закон «О днях воинской славы (Победных днях России)». Одной из правок было введение нового праздника — Дня народного единства — и фактическое перенесение государственного выходного дня с 7 ноября (День согласия и примирения) на 4 ноября.",
    "date": {
      "day": 4,
      "month": 11
    },
    "category": "General holidays",
    "notify": true
  }
]